{
  "refexp_token_to_idx": {
    "<NULL>": 0,
    "<START>": 1,
    "<END>": 2,
    "<UNK>": 3,
    ";": 4,
    "Any": 5,
    "Find": 6,
    "Look": 7,
    "The": 8,
    "and": 9,
    "are": 10,
    "as": 11,
    "at": 12,
    "ball": 13,
    "ball(s)": 14,
    "behind": 15,
    "big": 16,
    "block": 17,
    "block(s)": 18,
    "blue": 19,
    "both": 20,
    "brown": 21,
    "color": 22,
    "cube": 23,
    "cube(s)": 24,
    "cyan": 25,
    "cylinder": 26,
    "cylinder(s)": 27,
    "eighth": 28,
    "either": 29,
    "fifth": 30,
    "first": 31,
    "fourth": 32,
    "from": 33,
    "front": 34,
    "fully": 35,
    "gray": 36,
    "green": 37,
    "have": 38,
    "in": 39,
    "is": 40,
    "it": 41,
    "large": 42,
    "left": 43,
    "made": 44,
    "material": 45,
    "matte": 46,
    "metal": 47,
    "metallic": 48,
    "nineth": 49,
    "object": 50,
    "object(s)": 51,
    "objects": 52,
    "of": 53,
    "on": 54,
    "one": 55,
    "or": 56,
    "other": 57,
    "partially": 58,
    "purple": 59,
    "red": 60,
    "right": 61,
    "rubber": 62,
    "same": 63,
    "second": 64,
    "seventh": 65,
    "shape": 66,
    "shiny": 67,
    "side": 68,
    "sixth": 69,
    "size": 70,
    "small": 71,
    "sphere": 72,
    "sphere(s)": 73,
    "that": 74,
    "the": 75,
    "thing": 76,
    "thing(s)": 77,
    "things": 78,
    "third": 79,
    "tiny": 80,
    "to": 81,
    "visible": 82,
    "yellow": 83
  },
  "program_token_to_idx": {
    "<NULL>": 0,
    "<START>": 1,
    "<END>": 2,
    "<UNK>": 3,
    "filter_color[blue]": 4,
    "filter_color[brown]": 5,
    "filter_color[cyan]": 6,
    "filter_color[gray]": 7,
    "filter_color[green]": 8,
    "filter_color[purple]": 9,
    "filter_color[red]": 10,
    "filter_color[yellow]": 11,
    "filter_material[metal]": 12,
    "filter_material[rubber]": 13,
    "filter_ordinal[the eighth one of the,from front]": 14,
    "filter_ordinal[the eighth one of the,from left]": 15,
    "filter_ordinal[the eighth one of the,from right]": 16,
    "filter_ordinal[the fifth one of the,from front]": 17,
    "filter_ordinal[the fifth one of the,from left]": 18,
    "filter_ordinal[the fifth one of the,from right]": 19,
    "filter_ordinal[the first one of the,from front]": 20,
    "filter_ordinal[the first one of the,from left]": 21,
    "filter_ordinal[the first one of the,from right]": 22,
    "filter_ordinal[the fourth one of the,from front]": 23,
    "filter_ordinal[the fourth one of the,from left]": 24,
    "filter_ordinal[the fourth one of the,from right]": 25,
    "filter_ordinal[the nineth one of the,from front]": 26,
    "filter_ordinal[the nineth one of the,from left]": 27,
    "filter_ordinal[the nineth one of the,from right]": 28,
    "filter_ordinal[the second one of the,from front]": 29,
    "filter_ordinal[the second one of the,from left]": 30,
    "filter_ordinal[the second one of the,from right]": 31,
    "filter_ordinal[the seventh one of the,from front]": 32,
    "filter_ordinal[the seventh one of the,from left]": 33,
    "filter_ordinal[the seventh one of the,from right]": 34,
    "filter_ordinal[the sixth one of the,from front]": 35,
    "filter_ordinal[the sixth one of the,from left]": 36,
    "filter_ordinal[the sixth one of the,from right]": 37,
    "filter_ordinal[the third one of the,from front]": 38,
    "filter_ordinal[the third one of the,from left]": 39,
    "filter_ordinal[the third one of the,from right]": 40,
    "filter_shape[cube]": 41,
    "filter_shape[cylinder]": 42,
    "filter_shape[sphere]": 43,
    "filter_size[large]": 44,
    "filter_size[small]": 45,
    "filter_visible[fully visible]": 46,
    "filter_visible[partially visible]": 47,
    "intersect": 48,
    "relate[behind]": 49,
    "relate[front]": 50,
    "relate[left]": 51,
    "relate[right]": 52,
    "same_color": 53,
    "same_material": 54,
    "same_shape": 55,
    "same_size": 56,
    "scene": 57,
    "union": 58,
    "unique": 59
  },
  "answer_token_to_idx": null
}